{
  "module": "keras",
  "class_name": "Sequential",
  "config": {
    "name": "sequential_4",
    "trainable": true,
    "dtype": {
      "module": "keras",
      "class_name": "DTypePolicy",
      "config": { "name": "float32" },
      "registered_name": null
    },
    "layers": [
      {
        "module": "keras.layers",
        "class_name": "InputLayer",
        "config": {
          "batch_shape": [null, 64, 64, 3],
          "dtype": "float32",
          "sparse": false,
          "name": "input_layer_4"
        },
        "registered_name": null
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_6",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 32,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 64, 64, 3] }
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_6",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 62, 62, 32] }
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_7",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 31, 31, 32] }
      },
      {
        "module": "keras.layers",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_7",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "pool_size": [2, 2],
          "padding": "valid",
          "strides": [2, 2],
          "data_format": "channels_last"
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 29, 29, 64] }
      },
      {
        "module": "keras.layers",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_8",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "filters": 64,
          "kernel_size": [3, 3],
          "strides": [1, 1],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [1, 1],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 14, 14, 64] }
      },
      {
        "module": "keras.layers",
        "class_name": "Flatten",
        "config": {
          "name": "flatten_1",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "data_format": "channels_last"
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 12, 12, 64] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 9216] }
      },
      {
        "module": "keras.layers",
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "trainable": true,
          "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": { "name": "float32" },
            "registered_name": null
          },
          "units": 10,
          "activation": "softmax",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": { "seed": null },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "registered_name": null,
        "build_config": { "input_shape": [null, 64] }
      }
    ],
    "build_input_shape": [null, 64, 64, 3]
  },
  "registered_name": null,
  "build_config": { "input_shape": [null, 64, 64, 3] },
  "compile_config": {
    "optimizer": {
      "module": "keras.optimizers",
      "class_name": "Adam",
      "config": {
        "name": "adam",
        "learning_rate": 0.0010000000474974513,
        "weight_decay": null,
        "clipnorm": null,
        "global_clipnorm": null,
        "clipvalue": null,
        "use_ema": false,
        "ema_momentum": 0.99,
        "ema_overwrite_frequency": null,
        "loss_scale_factor": null,
        "gradient_accumulation_steps": null,
        "beta_1": 0.9,
        "beta_2": 0.999,
        "epsilon": 1e-7,
        "amsgrad": false
      },
      "registered_name": null
    },
    "loss": {
      "module": "builtins",
      "class_name": "function",
      "config": "sparse_categorical_crossentropy",
      "registered_name": "function"
    },
    "loss_weights": null,
    "metrics": ["accuracy"],
    "weighted_metrics": null,
    "run_eagerly": false,
    "steps_per_execution": 1,
    "jit_compile": true
  }
}
